### Vlookup is an operation used to merge 2 different data tables based on some condition 

### To do Vlookup there must be at least 1 common attribute(column) between the two tables.

### merge() function to perform Vlookup in pandas

### Four types of merge is available inner, left, right and outer

In [2]:
import pandas as pd
import os

In [3]:
os.chdir('/home/janaki/hyundai')

In [4]:
df1 = pd.read_csv('personal.csv')
df2 = pd.read_csv('courses.csv')

In [5]:
print(df1)

      Name  Age  Gender
0    Kumar   20    Male
1     Raja   19    Male
2  Lakshmi   18  Female
3    Radha   20  Female
4  Prasath   19    Male

In [6]:
print(df2)

      Name        Courses
0    Kumar            DSA
1     Raja           OOPS
2  Lakshmi  C Programming
3    Radha            SQL
4  Vignesh            DSA

### Inner merge - Will contain only values that are common in the merge fields of the dataframes

In [7]:
inner = pd.merge(df1,df2,on='Name',how='inner')

In [8]:
inner

      Name  Age  Gender        Courses
0    Kumar   20    Male            DSA
1     Raja   19    Male           OOPS
2  Lakshmi   18  Female  C Programming
3    Radha   20  Female            SQL

In [10]:
left = pd.merge(df1,df2,on='Name',how='left')

In [11]:
left

      Name  Age  Gender        Courses
0    Kumar   20    Male            DSA
1     Raja   19    Male           OOPS
2  Lakshmi   18  Female  C Programming
3    Radha   20  Female            SQL
4  Prasath   19    Male            NaN

In [12]:
right = pd.merge(df1,df2,on='Name',how='right')

In [13]:
right

      Name   Age  Gender        Courses
0    Kumar  20.0    Male            DSA
1     Raja  19.0    Male           OOPS
2  Lakshmi  18.0  Female  C Programming
3    Radha  20.0  Female            SQL
4  Vignesh   NaN     NaN            DSA

In [14]:
outer = pd.merge(df1,df2,on='Name',how='outer')

In [15]:
outer

      Name   Age  Gender        Courses
0    Kumar  20.0    Male            DSA
1     Raja  19.0    Male           OOPS
2  Lakshmi  18.0  Female  C Programming
3    Radha  20.0  Female            SQL
4  Prasath  19.0    Male            NaN
5  Vignesh   NaN     NaN            DSA